/*
Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет
*/

using System;
using static System.Console;

Clear();
WriteLine("Программа сообщает, является ли номер дня недели выходным днем");
Write("Введите число:");
int Number = Convert.ToInt32(ReadLine());

if (Number < 0)
{
    WriteLine ("День недели не может быть отрицательным");
    Number = Math.Abs(Number);
}

WriteLine (Number < 6 ? $"День недели под номером {Number} не является выходным " : Number < 8 ? $"День недели под номером {Number} является выходным " : 
$"В неделе всего 7 дней, а не {Number}");
